Revit 2024 API
TransferredProjectStandardsEventArgs Methods
The TransferredProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSelectedExternalItems
 Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace